app/controllers/books_controller.rb

    def index
        books = Review.all
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = $1  [["book_id", 20]]

    def show
        book = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]