app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
    def show
        book = Book.find(params[:id])

INSERT INTO "books" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-09-07 14:25:21.966824"], ["updated_at", "2020-09-07 14:25:21.966824"]]
---
     def create
        book = Book.create(book_params)