app/controllers/reviews_controller.rb

    def create
        review = Review.create(review_params)
---
INSERT INTO "reviews" ("review", "rating", "user_id", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["review", "Really good, provides lots of structure"], ["rating", "5"], ["user_id", 7], ["book_id", 21], ["created_at", "2020-09-08 22:21:41.538205"], ["updated_at", "2020-09-08 22:21:41.538205"]]